// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let z = [3, 4, 7, 1, 0];
// let x = ["sss", "ddd", "aaa", "fff", "ggg"];
// let c = ["sss", "ddd", 4, true, false];
// console.log(z);
// console.log(x);
// console.log(c);

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// let x = [122,123,124,125,126,127,128,129,134];
// for (let xs of x) {
//     document.write(`<div>${xs}</div>`);
// }

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// let x = [11, 12, 13, 14, 15, 16, 17, 18, 19, 20];
// for (i=0; i<x.length; i++) {
//     document.write(`${x[0]} <br>`) // Я знаю що тут покаже undefined 6-10 блок
// }

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let x = "Block";
// i=0;
// while (i < 20){
//     document.write(`<h1>${x}</h1> <br>`);
//     i++;
// }

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let x = [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30];
// i = 0;
// while (i < x.length){
//     document.write(`${x[i]} <br>`);
//     i++;
// }

//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let x = [10, 11, 12, 13, 14, 15, 16, 17, 18, 19];
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i]);
// }

//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let x = ["10", "11", "12", "13", "14", "15", "16", "17", "18", "19"];
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i]);
// }

//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let x = ["10", "11", "12", "13", 14, 15, 16, 17, false, true];
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i]);
// }

//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let x = ["10", "11", "12", "13", 14, 15, 16, 17, false, true];
// for (let i = 0; i < x.length; i++) {
//     if (typeof x[i] === 'boolean'){
//         console.log(x[i])
//     }
// }

//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let x = ["10", "11", "12", "13", 14, 15, 16, 17, false, true];
// for (let i = 0; i < x.length; i++) {
//     if (typeof x[i] === "number"){
//         console.log(x[i]);
//     }
// }

//- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let x = ["10", "11", "12", "13", 14, 15, 16, 17, false, true];
// for (let i = 0; i < x.length; i++) {
//     if (typeof x[i] === "string"){
//         console.log(x[i]);
//     }
// }

//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
// let x = [];
// x[0] = 1;
// x[1] = 2;
// x[2] = 3;
// x[3] = 4;
// x[4] = '5';
// x[5] = '6'
// x[6] = '7';
// x[7] = '8';
// x[8] = false;
// x[9] = true;
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i]);
// }

//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// let x = 1;
// for (i=0; i<10; i++){
//     console.log(i);
//     document.write(`${i} <br>`);
// }


//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// let x = 1;
// for (i=0; i<100; i++){
//     console.log(i);
//     document.write(`${i} <br>`);
// }

//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// let x = 1;
// for (i=0; i<100; i=i+2){
//     console.log(i);
//     document.write(`${i} <br>`);
// }

//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// let x = 1;
// for (i=0; i<100; i++){
//     if (i % 2 === 0){
//         console.log(i);
//         document.write(`${i} <br>`)
//     }
// }

//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// let x = 1;
// for (i=0; i<100; i++){
//     if (i % 2 === 1){
//         console.log(i);
//         document.write(`${i} <br>`)
//     }
// }