// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = prompt('введіть від 0 до 59')
// if(time >= 0 && time <= 14){
//     console.log("перша чверть");
// }else if(time >= 15 && time <= 29){
//     console.log('друга чверть');
// }else if(time >= 30 && time <= 44){
//     console.log('третя чверть');
// }else if(time >= 45 && time <= 59){
//     console.log('четверта чверть');
// }else{
//     console.log("невірне число")
// }


//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = prompt("введіть число від 1 до 31");
// if(day >= 1 && day <= 10){
//     console.log("перша декада");
// }else if(day >= 11 && day <= 20){
//     console.log("друга декада");
// }else if(day >= 21 && day <= 31){
//     console.log("третя декада");
// }else{
//     console.log("невірне число");
// }


//- У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = confirm();
// if(test === true){
//     console.log("вірно");
// }else{
//     console.log("не вірно");
// }


//- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = +prompt("введіть: 1, 0, -3");
// if (a !== 0){
//     console.log("Вірно");
// }else{
//     console.log("Не вірно");
// }


//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня
// і на екрані відображається інфа що заплановано на цей день.
// let z = prompt("Введіть день тижня");
// switch (z){
//     case'понеділок':
//         console.log("вчитися")
//         break;
//     case'вівторок':
//         console.log("вчитися + робота")
//         break;
//     case'середа':
//         console.log("вчитися + відпочинок")
//         break;
//     case'четвер':
//         console.log("вчитися + спорт")
//         break;
//     case'пятниця':
//         console.log("вчитися + поїздка")
//         break;
//     case'субота':
//         console.log("відпочивати")
//         break;
//     case'неділя':
//         console.log("нічого")
//         break;
//     default:{
//         console.log("Не вірно ввели день тижня")
//     }
// }


//- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = +prompt("введіть рік");
// if(year % 4 === 0){
//     console.log("Високосний рік");
// }else{
//     console.log("Не високосний рік");
// }

//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let c = prompt("Яка «офіційна» назва JavaScript?");
// if(c === "ECMAScript"){
//     console.log("Правильно!");
// }else{
//     console.log("Не знаєте? ECMAScript!");
// }