//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
// let z = +prompt('Введіть перше число');
// let x = +prompt('Введіть другн число');
// if(z > x){
//     console.log("Це число більше -", z);
// }else if (x > z){
//     console.log("Це число більше -", x);
// }else if(z === x){
//     console.log("Ці числа рівні");
// }else{
//     console.log("Це не число");
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let x = 100;
// if(x >= 1 && x <=20){
//     console.log("Ця квартира знаходться в першому підїзді");
// }else if(x >= 21 && x <=48){
//     console.log("Ця квартира знаходться в другому підїзді");
// }else if(x >= 49 && x <=90){
//     console.log("Ця квартира знаходться в другому підїзді");
// }else {
//     console.log("Такого номеру квартири немає в підїзді");
// }


//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО
// let x = +prompt('зададіть число');
// if(x === 10){
//     console.log("Вірно");
// }else{
//     console.log("Не вірно")
// }


//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
// let x =1;
// if(typeof x === "number"){
//     console.log("1")
// }else if(typeof x === "string"){
//     console.log("2")
// }else if (typeof x === "boolean"){
//     console.log("3")
// }else if (typeof x === "object"){
//     console.log("3")
// }else{
//     console.log("-__-")
// }


//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let x = +prompt("введіть температуру");
// if(x >= 10 && x <= 22){
//     console.log("йдемо ВЧИТИСЯ")
// }else{
//     console.log("сидимо вдома і вчимося ОНЛАЙН")
// }


//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let x = +prompt("вводіть число від 1 до 5");
// switch (x){
//     case 1:
//         console.log("виграв авто");
//         break;
//     case 2:
//         console.log("виграв квартиру");
//         break;
//     case 3:
//         console.log("виграв мотоцикл");
//         break;
//     case 4:
//         console.log("виграв телефон");
//         break;
//     case 5:
//         console.log("виграв телевізор");
//         break;
//     default:
//         console.log("Не вірне число")
// }